#include <iostream>

int main() {
    int a = -5;
    std::cout<<"Result = "<<a<<std::endl;
    a = -a;
    std::cout<<"Result = "<<a<<std::endl;
    return 0;
	/*
		бинарные это 
			сложение 5+5 
			выичитание 5-5
			умножение 5*5
			деление 5/5
			деление по модулю 5%5
		так же есть кроме арифмитических есть 
		операции равенство 
			равен ==
			не равен !=
		+ еще есть 
		операции сравнение 
		меньше <
		больше >
		меньше или равно <=
		больше или равно >=
        тернарные - это оператор, использующий более двух операндов 
	*/
}